
## Plan Result (portfolio/terraform_github)

[CI link](https://github.com/tqer39/terraform-aws/actions/runs/4587250968)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.deploy_role.aws_iam_role.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.deploy_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:tqer39/terraform-github:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::072693953877:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::072693953877:policy/deploy-allow-specifics",
          + "arn:aws:iam::072693953877:policy/deploy-deny-specifics",
        ]
      + max_session_duration  = 3600
      + name                  = "portfolio-terraform-github-deploy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "pl:environment" = "portfolio"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          + "pl:product"     = "terraform-aws"
          + "pl:repository"  = "tqer39/terraform-aws"
          + "pl:source_path" = "./terraform/environments/portfolio/terraform_github"
        }
      + unique_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":198,"Program":"tfcmt","SHA1":"6c252738d1b94163e990edd4c020f5ffa5ec3c5a","Target":"portfolio/terraform_github","Vars":{},"WorkflowName":"Terraform - AWS - Portfolio"} -->